//
//  InfoText.swift
//  Habits
//
//  Created by Кирилл Пономаренко on 02.08.2022.
//

import UIKit
import Foundation

struct TextForInfoVC {
    static let heading = "Привычка за 21 день"
    static let subtitle = "Прохождение этапов, за которые за 21 день вырабатывается привычка, подчиняется следующему алгоритму:"
    static let paragraph1 = "1. Провести 1 день без обращения к старым привычкам, стараться вести себя так, как будто цель, загаданная в перспективу, находится на расстоянии шага."
    static let paragraph2 = "2. Выдержать 2 дня в прежнем состоянии самоконтроля."
    static let paragraph3 = "3. Отметить в дневнике первую неделю изменений и подвести первые итоги — что оказалось тяжело, что — легче, с чем еще предстоит серьезно бороться."
    static let paragraph4 = "4. Поздравить себя с прохождением первого серьезного порога в 21 день. За это время отказ от дурных наклонностей уже примет форму осознанного преодоления и человек сможет больше работать в сторону принятия положительных качеств."
    static let paragraph5 = "5. Держать планку 40 дней. Практикующий методику уже чувствует себя освободившимся от прошлого негатива и двигается в нужном направлении с хорошей динамикой."
    static let paragraph6 = "6. На 90-й день соблюдения техники все лишнее из «прошлой жизни» перестает напоминать о себе, и человек, оглянувшись назад, осознает себя полностью обновившимся."
    static let source = "Источник: psychbook.ru"
}
